org/redes/14.org
#+title:Redes Móviles
Capítulo: 7-7.3.2 (pág 546–570)

* DONE introduccion

  imagen 7.1

  Elementos en una red inalambrica:
  - Hosts inalambricos :: son dispositivos end-system que ejecutan
    aplicaciones. puede ser una laptop, tablet, smartphone, pc. pueden no ser
    mobiles en si.
  - Enlaces inalambricos :: un host se conecta a una =base station= o a otro host
    inalambrico mediante un =enlace de comunicacion inalambrico=. Different
    wireless link technologies have different transmission rates and can transmit
    over different distances.
  - Base station :: no tiene equivalente en redes alambricas. es responsable de
    enviar y reciir datos (paquetes) desde y hacia un host inalambrico que esta
    asociado a esa base station. tambien es responsable de coordinar la
    transmicion de multiples hosts inalambricos a los cuales esta asociada, que
    significa que:
    1) el host esta dentro del rango de comunicacion de la base station
    2) el host utiliza dicha base station para entregar datos entre el host y el
       resto de la red.
    unos ejemplos de base stations son: torres de celulares y access points en
    802.11.

    los hosts asociados a una base station , se les dice que operan en =modo
    infraestructura=, ya que los servicios tradicionales (ej: asignacion de
    direccion y ruteo) son provistos por la red a la cual la base station esta
    conectada.

    En redes =ad hoc=, los hosts inalambricos no tienen tal infraestructura a la
    cual conectarse. en este caso, los hosts mismos son responsables de proveer
    estos servicios, tales como routeo, asignacion de direcciones, traduccion de
    nombre DNS, etc.

    cuando un host inalambrico se mueve del rango de una base station y entra en el
    rango de otra, cambia el punto de ingreso a la red, proceso conocido como
    =handoff=.

  - Infraestructura de red :: red mas grande a la cual un host inalambrico desea
    conectarse.


  PUBLIC WIFI ACCESS: COMING SOON TO A LAMP POST NEAR YOU?


clasificacion de redes inalambricas:
- si un paquete en la red realiza exactamente un solo salto o multiples saltos
- si existe infraestructura (como una base station) en la red

- un salto, con infraestructura :: redes con una base station conectada a una
  red alambrica mas grande (ej: internet). toda comunicacion es entre la base
  station y el host inalambrico (sin intermediarios). Ej: aula, cafe,
  biblioteca, red celular 4G LTE.
- un salto, sin infraestructura :: no hay base statios, sin embargo un nodo
  puede coordinar las transmiciones de otros nodos. Ej: redes bluetooth y redes
  802.11 en modo ad hoc
- multiples saltos, con infraestructura :: la base station esta conectada al
  resto de la red, pero algunos nodos pueden llegar a depender de otros nodos
  inalambricos intermediarios para poder comunicarse a la base station. Ej:
  redes de sensores inalambricos, =wireless mesh networks=.
- multiples saltos, sin infraestructura :: no hay base station y los nodos deben
  depender de otros para poder llegar al destino. Los nodos pueden ser mobiles,
  por lo que la conectividad puede cambiar, un tipo de redes conocido como
  =mobile ad hoc networks (MANETs)=.

* TODO Enlaces inalambricos y caracteristicas de la red

Diferencias entre enlaces alambricos e inalambricos:
- Decresiente intensidad de señal :: la radiacion electromagnetica se atenua
  cuando pasa a traves de materia e incluso al solamente propagarse en el vacio.
- Interferencia con otras fuentes :: fuentes de transmicion en la misma
  frecuencia interfieren unas con otras.
- Propagacion Multipath :: ocurre cuando porciones de la onda electromagnetica
  se reflejan sobre ojetos y el suelo (tierra?), tomando caminos de distancias
  diferentes entre el que envia y el que recibe. esto provoca que se reciba una
  señal distorsionada.

Por estas caracteristicas mencionadas, los errores son mas comunes en enlaces
inalambricos que en los alambricos.

Nos enfocamos ahora en como un host recibe una señal electromagnetica. esta
señal es una combinacion de la señal orinal transmitida por el emisor y ruido
del medio. se utiliza la relacion =señal a ruido= (=signal-to-noise ratio
(SNR)=) para medir las intensidades relativas.

imagen 7.3

imagen 7.4

bit error rate (BER) , probabilidad de que un bit transmitido es recibido con
error

- For a given modulation scheme, the higher the SNR, the lower the BER :: Since
  a sender can increase the SNR by increasing its transmission power, a sender
  can decrease the probability that a frame is received in error by increasing
  its transmission power. Note, however, that there is arguably little practical
  gain in increasing the power beyond a certain threshold, say to decrease the
  BER from to . There are also disadvantages associated with increasing the
  transmission power: More energy must be expended by the sender (an important
  concern for battery-powered mobile users), and the sender’s transmissions are
  more likely to interfere with the transmissions of another sender (see Figure
  7.4(b)).
- For a given SNR, a modulation technique with a higher bit transmission rate (whether in error or not) will have a higher BER :: For
  example, in Figure 7.3, with an SNR of 10 dB, BPSK modulation with a
  transmission rate of 1 Mbps has a BER of less than , while with QAM16
  modulation with a transmission rate of 4 Mbps, the BER is , far too high to be
  practically useful.  However, with an SNR of 20 dB, QAM16 modulation has a
  transmission rate of 4 Mbps and a BER of , while BPSK modulation has a
  transmission rate of only 1 Mbps and a BER that is so low as to be (literally)
  “off the charts.” If one can tolerate a BER of , the higher transmission rate
  offered by QAM16 would make it the preferred modulation technique in this
  situation. These considerations give rise to the final characteristic,
  described next.
- Dynamic selection of the physical-layer modulation technique can be used to adapt the modulation technique to channel conditions :: The
  SNR (and hence the BER) may change as a result of mobility or due to changes
  in the environment. Adaptive modulation and coding are used in cellular data
  systems and in the 802.11 WiFi and 4G cellular data networks . This allows,
  for example, the selection of a modulation technique that provides the highest
  transmission rate possible subject to a constraint on the BER, for given
  channel characteristics.

A higher and time-varying bit error rate is not the only difference between a
wired and wireless link.


en enlaces inalambricos, no todos los nodos pueden recibir transmiciones de
otros nodos.

Suppose that Station A is transmitting to Station B. Suppose also
that Station C is transmitting to Station B.

1. se llama =hidden terminal problem= cuando obstrucciones fisicas en el medio
   (montaña, eficio), no permiten que A y C escuchen las transmiciones del otro,
   a pesar de que sus señales se interfieren en el destino B. (7.4 a)
2. otro escenario que resulta en que el enlace no sea detectable ocurre cuando
   la señal que se progapa, se ve atenuada debido a la distancia entre los
   nodos. esto se conoce como =fading= (atenuacion) (7.4 b)

