redes/14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 12:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Redes Móviles</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="../res/org.css"/>
</head>
<body>
<div id="content">
<p>
Capítulo: 7-7.3.2 (pág 546–570)
</p>

<div id="outline-container-org8bfc181" class="outline-2">
<h2 id="org8bfc181"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> introduccion</h2>
<div class="outline-text-2" id="text-1">
<p>
imagen 7.1
</p>

<p>
Elementos en una red inalambrica:
</p>
<dl class="org-dl">
<dt>Hosts inalambricos</dt><dd>son dispositivos end-system que ejecutan
aplicaciones. puede ser una laptop, tablet, smartphone, pc. pueden no ser
mobiles en si.</dd>
<dt>Enlaces inalambricos</dt><dd>un host se conecta a una <code>base station</code> o a otro host
inalambrico mediante un <code>enlace de comunicacion inalambrico</code>. Different
wireless link technologies have different transmission rates and can transmit
over different distances.</dd>
<dt>Base station</dt><dd><p>
no tiene equivalente en redes alambricas. es responsable de
enviar y reciir datos (paquetes) desde y hacia un host inalambrico que esta
asociado a esa base station. tambien es responsable de coordinar la
transmicion de multiples hosts inalambricos a los cuales esta asociada, que
significa que:
</p>
<ol class="org-ol">
<li>el host esta dentro del rango de comunicacion de la base station</li>
<li>el host utiliza dicha base station para entregar datos entre el host y el
resto de la red.</li>
</ol>
<p>
unos ejemplos de base stations son: torres de celulares y access points en
802.11.
</p>

<p>
los hosts asociados a una base station , se les dice que operan en <code>modo
    infraestructura</code>, ya que los servicios tradicionales (ej: asignacion de
direccion y ruteo) son provistos por la red a la cual la base station esta
conectada.
</p>

<p>
En redes <code>ad hoc</code>, los hosts inalambricos no tienen tal infraestructura a la
cual conectarse. en este caso, los hosts mismos son responsables de proveer
estos servicios, tales como routeo, asignacion de direcciones, traduccion de
nombre DNS, etc.
</p>

<p>
cuando un host inalambrico se mueve del rango de una base station y entra en el
rango de otra, cambia el punto de ingreso a la red, proceso conocido como
<code>handoff</code>.
</p></dd>

<dt>Infraestructura de red</dt><dd>red mas grande a la cual un host inalambrico desea
conectarse.</dd>
</dl>


<p>
PUBLIC WIFI ACCESS: COMING SOON TO A LAMP POST NEAR YOU?
</p>


<p>
clasificacion de redes inalambricas:
</p>
<ul class="org-ul">
<li>si un paquete en la red realiza exactamente un solo salto o multiples saltos</li>
<li>si existe infraestructura (como una base station) en la red</li>

<li id="un salto, con infraestructura">redes con una base station conectada a una
red alambrica mas grande (ej: internet). toda comunicacion es entre la base
station y el host inalambrico (sin intermediarios). Ej: aula, cafe,
biblioteca, red celular 4G LTE.</li>
<li id="un salto, sin infraestructura">no hay base statios, sin embargo un nodo
puede coordinar las transmiciones de otros nodos. Ej: redes bluetooth y redes
802.11 en modo ad hoc</li>
<li id="multiples saltos, con infraestructura">la base station esta conectada al
resto de la red, pero algunos nodos pueden llegar a depender de otros nodos
inalambricos intermediarios para poder comunicarse a la base station. Ej:
redes de sensores inalambricos, <code>wireless mesh networks</code>.</li>
<li id="multiples saltos, sin infraestructura">no hay base station y los nodos deben
depender de otros para poder llegar al destino. Los nodos pueden ser mobiles,
por lo que la conectividad puede cambiar, un tipo de redes conocido como
<code>mobile ad hoc networks (MANETs)</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa365af" class="outline-2">
<h2 id="orgfa365af"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Enlaces inalambricos y caracteristicas de la red</h2>
<div class="outline-text-2" id="text-2">
<p>
Diferencias entre enlaces alambricos e inalambricos:
</p>
<dl class="org-dl">
<dt>Decresiente intensidad de señal</dt><dd>la radiacion electromagnetica se atenua
cuando pasa a traves de materia e incluso al solamente propagarse en el vacio.</dd>
<dt>Interferencia con otras fuentes</dt><dd>fuentes de transmicion en la misma
frecuencia interfieren unas con otras.</dd>
<dt>Propagacion Multipath</dt><dd>ocurre cuando porciones de la onda electromagnetica
se reflejan sobre ojetos y el suelo (tierra?), tomando caminos de distancias
diferentes entre el que envia y el que recibe. esto provoca que se reciba una
señal distorsionada.</dd>
</dl>

<p>
Por estas caracteristicas mencionadas, los errores son mas comunes en enlaces
inalambricos que en los alambricos.
</p>

<p>
Nos enfocamos ahora en como un host recibe una señal electromagnetica. esta
señal es una combinacion de la señal orinal transmitida por el emisor y ruido
del medio. se utiliza la relacion <code>señal a ruido</code> (<code>signal-to-noise ratio
(SNR)</code>) para medir las intensidades relativas.
</p>

<p>
imagen 7.3
</p>

<p>
imagen 7.4
</p>

<p>
bit error rate (BER) , probabilidad de que un bit transmitido es recibido con
error
</p>

<dl class="org-dl">
<dt>For a given modulation scheme, the higher the SNR, the lower the BER</dt><dd>Since
a sender can increase the SNR by increasing its transmission power, a sender
can decrease the probability that a frame is received in error by increasing
its transmission power. Note, however, that there is arguably little practical
gain in increasing the power beyond a certain threshold, say to decrease the
BER from to . There are also disadvantages associated with increasing the
transmission power: More energy must be expended by the sender (an important
concern for battery-powered mobile users), and the sender’s transmissions are
more likely to interfere with the transmissions of another sender (see Figure
7.4(b)).</dd>
<dt>For a given SNR, a modulation technique with a higher bit transmission rate (whether in error or not) will have a higher BER</dt><dd>For
example, in Figure 7.3, with an SNR of 10 dB, BPSK modulation with a
transmission rate of 1 Mbps has a BER of less than , while with QAM16
modulation with a transmission rate of 4 Mbps, the BER is , far too high to be
practically useful.  However, with an SNR of 20 dB, QAM16 modulation has a
transmission rate of 4 Mbps and a BER of , while BPSK modulation has a
transmission rate of only 1 Mbps and a BER that is so low as to be (literally)
“off the charts.” If one can tolerate a BER of , the higher transmission rate
offered by QAM16 would make it the preferred modulation technique in this
situation. These considerations give rise to the final characteristic,
described next.</dd>
<dt>Dynamic selection of the physical-layer modulation technique can be used to adapt the modulation technique to channel conditions</dt><dd>The
SNR (and hence the BER) may change as a result of mobility or due to changes
in the environment. Adaptive modulation and coding are used in cellular data
systems and in the 802.11 WiFi and 4G cellular data networks . This allows,
for example, the selection of a modulation technique that provides the highest
transmission rate possible subject to a constraint on the BER, for given
channel characteristics.</dd>
</dl>

<p>
A higher and time-varying bit error rate is not the only difference between a
wired and wireless link.
</p>


<p>
en enlaces inalambricos, no todos los nodos pueden recibir transmiciones de
otros nodos.
</p>

<p>
Suppose that Station A is transmitting to Station B. Suppose also
that Station C is transmitting to Station B.
</p>

<ol class="org-ol">
<li>se llama <code>hidden terminal problem</code> cuando obstrucciones fisicas en el medio
(montaña, eficio), no permiten que A y C escuchen las transmiciones del otro,
a pesar de que sus señales se interfieren en el destino B. (7.4 a)</li>
<li>otro escenario que resulta en que el enlace no sea detectable ocurre cuando
la señal que se progapa, se ve atenuada debido a la distancia entre los
nodos. esto se conoce como <code>fading</code> (atenuacion) (7.4 b)</li>
</ol>
</div>
