org/redes/14.org
** TODO Code Division Multiple Access (CDMA) :protocolo de acceso al medio:

pertenece a la familia de protocolos de particion de canal (entre acceso
aleatorio y por turnos).

en CDMA cada bit enviado esta codificado al multiplicar el bit por la señal (el
codigo) que cambia a una velocidad mucho mas grande (=chipping rate=) que la
secuencia de bits original

imagen 7.5

con la presencia de emisores que interfieren entre si, CDMA permite poder
discernir una señal codificada de otra.

CDMA asume que las señales transmitidas son aditivas, esto es, por ejemplo, si 3
emisores envian un 1, y cuarto emisor envia -1 durante el mismo mini-slot,
entoces la señal recibida en todos los receptores en dicho mini-slot es 2
(1+1+1-1=2).

...

* DONE WiFi: 802.11 Wireless LANs

existen diferentes estandares dentro de la familia del protocolo 802.11 (Wifi)

utilizan la misma estructura la el frame de capa de enlace, pueden reducir la
velocidad de transmicion para extender el alcance, son compatibles con versiones
anteriores.

sin embargo tienen diferencias en la capa fisica. operan en dos rangos de
frecuencias 2.4-2.485 GHz y 5.1-5.8 GHz.

| Standard | Frequency range   | data range      |
|----------+-------------------+-----------------|
| 802.11b  | 2.4 GHz           | up to 11 Mbps   |
| 802.11a  | 5 GHz             | up to 54 Mbps   |
| 802.11g  | 2.4 GHz           | up to 54 Mbps   |
| 802.11n  | 2.5 GHz and 5 GHz | up to 450 Mbps  |
| 802.11ac | 5 GHz             | up to 1300 Mbps |


** Architecture

una pieza fundamental es el =basic service set (BSS)=. un bss contiene una o mas
estaciones inalambricas y una base station central, conocido como =access point
(AP)=.

imagen 7.7

una lan inalambrica con un AP se la llama tambien =infrastructure wireless lan=,
con infrastructure refiriendose al AP y su conexion con la internet.

la imagen 7.8 muestra una red ad hoc, una red si un control central ni
conexiones con el exterior.

*** Canales y Asociacion

en el protocolo 802.11 cada estacion inalambrica debe estar asociada a un AP
antes de enviar o recibir datos de capa de red.

cuando se instala un AP, se asigna un =Service Set Identifier (SSID)= al
AP. tambien se debe asignar un numero de canal al AP. dentro del rango de
frecuencia 2.4 GHz, se definen 11 canales parcialmente solapados. Dos canales no
estan solapados si y solo si estan separados por 4 o mas canales.


Una =Wifi jungle= es una ubicacion fisica en donde una estacion inalambrica
recibe señales suficientemente fuertes de dos o mas APs. para poder unirse una
subred del AP, una estacion debe =asociarse= al AP. se debe crear un enlace
virtual.


el protocolo 802.11 requiere que los AP envien =beacon frames= de forma
periodica que contienen el SSID y MAC del AP. El dispositivo escanea los 11
canales buscando beacon frames.

el proceso de escanear canales y escuchar por beacon frames se conoce como
=passive scanning=

imagen 7.9 a

Un dispositivo inalambrico tambien puede realizar =active scanning=, al hacer
broadcast de un =probe frame= que es recibido por todos los APs dentro del rango
del dispositivo. Los APs responden al frame y el dispositivo elige entre uno de
ellos.

imagen 7.9 b

Luego de seleccionar el AP al cual asociarse, el dispositivo envia al AP un
=asociation request frame= y el AP le responde. (parecido a DHCP)

Luego, Tipicamente para unirse a la subred del AP, el dispositivo envia un
mensaje DHCP.

En algunos casos se quiere que el dispositivo se autenticado por el AP. esto se
puede realizar mediante:
- validacion de MAC
- usuario y contraseña

en ambos casos el AP puede comunicarse con un servidor autenticador separado,
para poder proveer a varios APs simultaneamente, centralizando la informacion
sensible, matener la complejidad y costo del AP bajo.

** Protocolo MAC 802.11

como protocolo de acceso al medio compartido, los diseñadores de 802.11 optaron
por uno de tipo de acceso aleatorio llamado =Carrier Sense Multiple Access
(CSMA) with Collision avoidance (CSMA/CA)=. Cada estacion escucha el enlace
antes de transmitir y espera mientras este ocupado.

diferencias entre protocolos MAC de Ethernet y 802.11:
1. ethernet utiliza =collision detection=, 802.11 utiliza =collision avoidance=
2. Wifi utiliza un esquema de =acknowledgement/retransmission (ARQ)= de capa de
   enlace.


ethernet utiliza =collision detection=, lo que significa que un dispositivo
transmite y escucha el canal al mismo tiempo. si escucha ruido, entonces para de
transmitir y espera un tiempo aleatorio para volver a hacerlo.
no se utiliza =collision detection= de ethernet porque:
- la señal recibida es en general mas atenuada con respecto a la señal de
  transmicion, por que hacer que el dispositivo haga ambos al mismo tiempo es
  mas costoso.
- se podria no detectar una colision debido a =hidden terminal problem= y
  =fading=.


en wifi, una vez que se empieza a transmitir un frame, se hace por completo.

*** esquema de acknowledgement de capa de enlace
debido a que un frame puede no llegar intacto a su destino, se utilizan
acknowledgement a nivel de capa de enlace. Cuando se recibe un frame que pasa
CRC (Cyclic Redundancy Check), se espera una cierta cantidad de tiempo =Short
Inter-frame Spacing (SIFS)= y luego responde con un acknowledgement

si la estacion que transmite no recibe un acuse de recibo dentro de una cierta
cantidad de tiempo, asume que ocurrio un error y retransmite el frame utilizando
CSMA/CA. Si no recibe acuse de recibo luego de retransmitir varias veces, se
descarta el frame.

*** CSMA/CA

1. si el canal esta libre, se transmite al frame luego de un periodo de tiempo
   corto conocido como =Distributed Inter-frame Space (DIFS)=.
2. en otro caso, se elige un tiempo aleatorio de espera utilizando binary
   exponential backoff. espera a que es canal este libre, espera DIFS, espera el
   tiempo aleatorio determinado. si se detecta señal en el canal, se congela el
   timer.
3. cuando el tiempo de espera llega a cero, se retransmite el frame por completo
   y espera por un acuse de recibo.
4. si se tiene otro frame para transmitir, empieza CSMA/CA desde el paso 2. si
   no se recibe acknowledgement, se vuelve al paso 2 con bin-exp-backoff mas
   grande.

por que se espera un tiempo mas luego de detectar a que el canal este libre?
si se transmite al momento de detectar al canal libre, se puede generar una
colision.
debido a que wifi no detecta colision y luego aborta la transmicion, un frame
que sufre de colision seria transmitido por completo.


