redes/14.html

<div id="outline-container-orgf731fa6" class="outline-3">
<h3 id="orgf731fa6"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Code Division Multiple Access (CDMA) :protocolo de acceso al medio:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
pertenece a la familia de protocolos de particion de canal (entre acceso
aleatorio y por turnos).
</p>

<p>
en CDMA cada bit enviado esta codificado al multiplicar el bit por la señal (el
codigo) que cambia a una velocidad mucho mas grande (<code>chipping rate</code>) que la
secuencia de bits original
</p>

<p>
imagen 7.5
</p>

<p>
con la presencia de emisores que interfieren entre si, CDMA permite poder
discernir una señal codificada de otra.
</p>

<p>
CDMA asume que las señales transmitidas son aditivas, esto es, por ejemplo, si 3
emisores envian un 1, y cuarto emisor envia -1 durante el mismo mini-slot,
entoces la señal recibida en todos los receptores en dicho mini-slot es 2
(1+1+1-1=2).
</p>

<p>
&#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-org64653a7" class="outline-2">
<h2 id="org64653a7"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> WiFi: 802.11 Wireless LANs</h2>
<div class="outline-text-2" id="text-3">
<p>
existen diferentes estandares dentro de la familia del protocolo 802.11 (Wifi)
</p>

<p>
utilizan la misma estructura la el frame de capa de enlace, pueden reducir la
velocidad de transmicion para extender el alcance, son compatibles con versiones
anteriores.
</p>

<p>
sin embargo tienen diferencias en la capa fisica. operan en dos rangos de
frecuencias 2.4-2.485 GHz y 5.1-5.8 GHz.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Standard</th>
<th scope="col" class="org-left">Frequency range</th>
<th scope="col" class="org-left">data range</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">802.11b</td>
<td class="org-left">2.4 GHz</td>
<td class="org-left">up to 11 Mbps</td>
</tr>

<tr>
<td class="org-left">802.11a</td>
<td class="org-left">5 GHz</td>
<td class="org-left">up to 54 Mbps</td>
</tr>

<tr>
<td class="org-left">802.11g</td>
<td class="org-left">2.4 GHz</td>
<td class="org-left">up to 54 Mbps</td>
</tr>

<tr>
<td class="org-left">802.11n</td>
<td class="org-left">2.5 GHz and 5 GHz</td>
<td class="org-left">up to 450 Mbps</td>
</tr>

<tr>
<td class="org-left">802.11ac</td>
<td class="org-left">5 GHz</td>
<td class="org-left">up to 1300 Mbps</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org63bde51" class="outline-3">
<h3 id="org63bde51"><span class="section-number-3">3.1</span> Architecture</h3>
<div class="outline-text-3" id="text-3-1">
<p>
una pieza fundamental es el <code>basic service set (BSS)</code>. un bss contiene una o mas
estaciones inalambricas y una base station central, conocido como <code>access point
(AP)</code>.
</p>

<p>
imagen 7.7
</p>

<p>
una lan inalambrica con un AP se la llama tambien <code>infrastructure wireless lan</code>,
con infrastructure refiriendose al AP y su conexion con la internet.
</p>

<p>
la imagen 7.8 muestra una red ad hoc, una red si un control central ni
conexiones con el exterior.
</p>
</div>

<div id="outline-container-orge4694a7" class="outline-4">
<h4 id="orge4694a7"><span class="section-number-4">3.1.1</span> Canales y Asociacion</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
en el protocolo 802.11 cada estacion inalambrica debe estar asociada a un AP
antes de enviar o recibir datos de capa de red.
</p>

<p>
cuando se instala un AP, se asigna un <code>Service Set Identifier (SSID)</code> al
AP. tambien se debe asignar un numero de canal al AP. dentro del rango de
frecuencia 2.4 GHz, se definen 11 canales parcialmente solapados. Dos canales no
estan solapados si y solo si estan separados por 4 o mas canales.
</p>


<p>
Una <code>Wifi jungle</code> es una ubicacion fisica en donde una estacion inalambrica
recibe señales suficientemente fuertes de dos o mas APs. para poder unirse una
subred del AP, una estacion debe <code>asociarse</code> al AP. se debe crear un enlace
virtual.
</p>


<p>
el protocolo 802.11 requiere que los AP envien <code>beacon frames</code> de forma
periodica que contienen el SSID y MAC del AP. El dispositivo escanea los 11
canales buscando beacon frames.
</p>

<p>
el proceso de escanear canales y escuchar por beacon frames se conoce como
<code>passive scanning</code>
</p>

<p>
imagen 7.9 a
</p>

<p>
Un dispositivo inalambrico tambien puede realizar <code>active scanning</code>, al hacer
broadcast de un <code>probe frame</code> que es recibido por todos los APs dentro del rango
del dispositivo. Los APs responden al frame y el dispositivo elige entre uno de
ellos.
</p>

<p>
imagen 7.9 b
</p>

<p>
Luego de seleccionar el AP al cual asociarse, el dispositivo envia al AP un
<code>asociation request frame</code> y el AP le responde. (parecido a DHCP)
</p>

<p>
Luego, Tipicamente para unirse a la subred del AP, el dispositivo envia un
mensaje DHCP.
</p>

<p>
En algunos casos se quiere que el dispositivo se autenticado por el AP. esto se
puede realizar mediante:
</p>
<ul class="org-ul">
<li>validacion de MAC</li>
<li>usuario y contraseña</li>
</ul>

<p>
en ambos casos el AP puede comunicarse con un servidor autenticador separado,
para poder proveer a varios APs simultaneamente, centralizando la informacion
sensible, matener la complejidad y costo del AP bajo.
</p>
</div>
</div>
</div>

<div id="outline-container-orga815275" class="outline-3">
<h3 id="orga815275"><span class="section-number-3">3.2</span> Protocolo MAC 802.11</h3>
<div class="outline-text-3" id="text-3-2">
<p>
como protocolo de acceso al medio compartido, los diseñadores de 802.11 optaron
por uno de tipo de acceso aleatorio llamado <code>Carrier Sense Multiple Access
(CSMA) with Collision avoidance (CSMA/CA)</code>. Cada estacion escucha el enlace
antes de transmitir y espera mientras este ocupado.
</p>

<p>
diferencias entre protocolos MAC de Ethernet y 802.11:
</p>
<ol class="org-ol">
<li>ethernet utiliza <code>collision detection</code>, 802.11 utiliza <code>collision avoidance</code></li>
<li>Wifi utiliza un esquema de <code>acknowledgement/retransmission (ARQ)</code> de capa de
enlace.</li>
</ol>


<p>
ethernet utiliza <code>collision detection</code>, lo que significa que un dispositivo
transmite y escucha el canal al mismo tiempo. si escucha ruido, entonces para de
transmitir y espera un tiempo aleatorio para volver a hacerlo.
no se utiliza <code>collision detection</code> de ethernet porque:
</p>
<ul class="org-ul">
<li>la señal recibida es en general mas atenuada con respecto a la señal de
transmicion, por que hacer que el dispositivo haga ambos al mismo tiempo es
mas costoso.</li>
<li>se podria no detectar una colision debido a <code>hidden terminal problem</code> y
<code>fading</code>.</li>
</ul>


<p>
en wifi, una vez que se empieza a transmitir un frame, se hace por completo.
</p>
</div>

<div id="outline-container-org2ce4546" class="outline-4">
<h4 id="org2ce4546"><span class="section-number-4">3.2.1</span> esquema de acknowledgement de capa de enlace</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
debido a que un frame puede no llegar intacto a su destino, se utilizan
acknowledgement a nivel de capa de enlace. Cuando se recibe un frame que pasa
CRC (Cyclic Redundancy Check), se espera una cierta cantidad de tiempo <code>Short
Inter-frame Spacing (SIFS)</code> y luego responde con un acknowledgement
</p>

<p>
si la estacion que transmite no recibe un acuse de recibo dentro de una cierta
cantidad de tiempo, asume que ocurrio un error y retransmite el frame utilizando
CSMA/CA. Si no recibe acuse de recibo luego de retransmitir varias veces, se
descarta el frame.
</p>
</div>
</div>

<div id="outline-container-org4cdd7f9" class="outline-4">
<h4 id="org4cdd7f9"><span class="section-number-4">3.2.2</span> CSMA/CA</h4>
<div class="outline-text-4" id="text-3-2-2">
<ol class="org-ol">
<li>si el canal esta libre, se transmite al frame luego de un periodo de tiempo
corto conocido como <code>Distributed Inter-frame Space (DIFS)</code>.</li>
<li>en otro caso, se elige un tiempo aleatorio de espera utilizando binary
exponential backoff. espera a que es canal este libre, espera DIFS, espera el
tiempo aleatorio determinado. si se detecta señal en el canal, se congela el
timer.</li>
<li>cuando el tiempo de espera llega a cero, se retransmite el frame por completo
y espera por un acuse de recibo.</li>
<li>si se tiene otro frame para transmitir, empieza CSMA/CA desde el paso 2. si
no se recibe acknowledgement, se vuelve al paso 2 con bin-exp-backoff mas
grande.</li>
</ol>

<p>
por que se espera un tiempo mas luego de detectar a que el canal este libre?
si se transmite al momento de detectar al canal libre, se puede generar una
colision.
debido a que wifi no detecta colision y luego aborta la transmicion, un frame
que sufre de colision seria transmitido por completo.
</p>
</div>
</div>
</div>
