org/redes/14.org
** Hidden terminals: RTS y CTS

existe un esquema opcional que ayuda a prevenir colisiones incluso con la presencia de
hidden terminals.

imagen 7.11

si ambos hosts de la imagen transmiten al mismo tiempo, ocurre una colision en
la cercania del AP y ninguno de los hosts se da cuenta.

para evitar el problema, se usan los frames de control =Request to Send (RTS)= y
=Clear to Send (CTS)= para reservar el acceso al canal. si se quiere transmitir,
se envia un RTS al AP indicando el tiempo requierido para transmitir sus datos y
un frame de acuse de recibo (?). Luego el AP recibe el RTS y responde con un CTS
explicitando que el dispositivo puede transmitir y los demas deben esperar por
la duracion que pidio el transmisor.

imagen 7.12

la performance puede mejorar en dos formas:
1. se mitiga el problema del hidden terminal, ya que los frames largos son
   transmitidos luego de que el canal sea reservado.
2. porque los frames de control son cortos, la duracion de la colision de frames
   RTS y CTS es corta

a pesar de ayudar a reducir colisiones, puede introducir delays y consume
recursos del canal. es por esto que en general se utiliza RTS/CTS para el envio
de frames largos.

** 802.11 como enlace punto a punto

si dos nodos cuentan con antenas direccionales, pueden apuntarse entre si y
formar un enlace punto a punto.
