redes/14.html


<div id="outline-container-org4e58e16" class="outline-3">
<h3 id="org4e58e16"><span class="section-number-3">3.3</span> Hidden terminals: RTS y CTS</h3>
<div class="outline-text-3" id="text-3-3">
<p>
existe un esquema opcional que ayuda a prevenir colisiones incluso con la presencia de
hidden terminals.
</p>

<p>
imagen 7.11
</p>

<p>
si ambos hosts de la imagen transmiten al mismo tiempo, ocurre una colision en
la cercania del AP y ninguno de los hosts se da cuenta.
</p>

<p>
para evitar el problema, se usan los frames de control <code>Request to Send (RTS)</code> y
<code>Clear to Send (CTS)</code> para reservar el acceso al canal. si se quiere transmitir,
se envia un RTS al AP indicando el tiempo requierido para transmitir sus datos y
un frame de acuse de recibo (?). Luego el AP recibe el RTS y responde con un CTS
explicitando que el dispositivo puede transmitir y los demas deben esperar por
la duracion que pidio el transmisor.
</p>

<p>
imagen 7.12
</p>

<p>
la performance puede mejorar en dos formas:
</p>
<ol class="org-ol">
<li>se mitiga el problema del hidden terminal, ya que los frames largos son
transmitidos luego de que el canal sea reservado.</li>
<li>porque los frames de control son cortos, la duracion de la colision de frames
RTS y CTS es corta</li>
</ol>

<p>
a pesar de ayudar a reducir colisiones, puede introducir delays y consume
recursos del canal. es por esto que en general se utiliza RTS/CTS para el envio
de frames largos.
</p>
</div>
</div>

<div id="outline-container-org64663f4" class="outline-3">
<h3 id="org64663f4"><span class="section-number-3">3.4</span> 802.11 como enlace punto a punto</h3>
<div class="outline-text-3" id="text-3-4">
<p>
si dos nodos cuentan con antenas direccionales, pueden apuntarse entre si y
formar un enlace punto a punto.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-09-16 12:29
</div>
</body>
</html>
